SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Bootloader/Device/MM32SPIN0260/Include/reg_flash.h
/**
  * @brief FLASH_OBR Register Bit Definition
  */
#define  FLASH_OBR_OPTERR_Pos                     (0)
#define  FLASH_OBR_OPTERR_Msk                     (0x1U << FLASH_OBR_OPTERR_Pos)                    /*!<Option byte error*/
#define  FLASH_OBR_OPTERR                         FLASH_OBR_OPTERR_Msk
#define  FLASH_OBR_RDP_Pos                        (1)
#define  FLASH_OBR_RDP_Msk                        (0x1U << FLASH_OBR_RDP_Pos)                       /*!<Read protection level status*/
#define  FLASH_OBR_RDP                            FLASH_OBR_RDP_Msk
#define  FLASH_OBR_WDG_SW_Pos                     (2)
#define  FLASH_OBR_WDG_SW_Msk                     (0x1U << FLASH_OBR_WDG_SW_Pos)                    /*!<Select watchdog event*/
#define  FLASH_OBR_WDG_SW                         FLASH_OBR_WDG_SW_Msk
#define  FLASH_OBR_nRST_STOP_Pos                  (3)
#define  FLASH_OBR_nRST_STOP_Msk                  (0x1U << FLASH_OBR_nRST_STOP_Pos)                 /*!<Reset event in stop mode*/
#define  FLASH_OBR_nRST_STOP                      FLASH_OBR_nRST_STOP_Msk
#define  FLASH_OBR_FLASH_ECCEN_Pos                (5)
#define  FLASH_OBR_FLASH_ECCEN_Msk                (0x1U << FLASH_OBR_FLASH_ECCEN_Pos)               /*!<FLASH_ECCEN*/
#define  FLASH_OBR_FLASH_ECCEN                    FLASH_OBR_FLASH_ECCEN_Msk
#define  FLASH_OBR_BOOT1_Pos                      (6)
#define  FLASH_OBR_BOOT1_Msk                      (0x1U << FLASH_OBR_BOOT1_Pos)                     /*!<BOOT1*/
#define  FLASH_OBR_BOOT1                          FLASH_OBR_BOOT1_Msk
#define  FLASH_OBR_OBR_NRST_Pos                   (7)
#define  FLASH_OBR_OBR_NRST_Msk                   (0x1U << FLASH_OBR_OBR_NRST_Pos)                  /*!<NRST pin multiplexed to PA10*/
#define  FLASH_OBR_OBR_NRST                       FLASH_OBR_OBR_NRST_Msk
#define  FLASH_OBR_BOOT0_Pos                      (8)
#define  FLASH_OBR_BOOT0_Msk                      (0x1U << FLASH_OBR_BOOT0_Pos)                     /*!<BOOT0SEL*/
#define  FLASH_OBR_BOOT0                          FLASH_OBR_BOOT0_Msk
#define  FLASH_OBR_BOOT0SEL_Pos                   (9)
#define  FLASH_OBR_BOOT0SEL_Msk                   (0x1U << FLASH_OBR_BOOT0SEL_Pos)                  /*!<BOOT0SEL*/
#define  FLASH_OBR_BOOT0SEL                       FLASH_OBR_BOOT0SEL_Msk
#define  FLASH_OBR_Data0_Pos                      (10)
#define  FLASH_OBR_Data0_Msk                      (0xFFU << FLASH_OBR_Data0_Pos)                    /*!<Data0*/
#define  FLASH_OBR_Data0                          FLASH_OBR_Data0_Msk
#define  FLASH_OBR_Data0_Bit0                     (0x01U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit1                     (0x02U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit2                     (0x04U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit3                     (0x08U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit4                     (0x10U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit5                     (0x20U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit6                     (0x40U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data0_Bit7                     (0x80U << FLASH_OBR_Data0_Pos) 
#define  FLASH_OBR_Data1_Pos                      (18)
#define  FLASH_OBR_Data1_Msk                      (0xFFU << FLASH_OBR_Data1_Pos)                    /*!<Data1*/
#define  FLASH_OBR_Data1                          FLASH_OBR_Data1_Msk
#define  FLASH_OBR_Data1_Bit0                     (0x01U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit1                     (0x02U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit2                     (0x04U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit3                     (0x08U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit4                     (0x10U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit5                     (0x20U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit6                     (0x40U << FLASH_OBR_Data1_Pos) 
#define  FLASH_OBR_Data1_Bit7                     (0x80U << FLASH_OBR_Data1_Pos) 

/**
  * @brief FLASH_WRPR Register Bit Definition
  */
#define  FLASH_WRPR_WRP_Pos                       (0)
#define  FLASH_WRPR_WRP_Msk                       (0x7FFFFFFFU << FLASH_WRPR_WRP_Pos)               /*!<Write protect*/
#define  FLASH_WRPR_WRP                           FLASH_WRPR_WRP_Msk
#define  FLASH_WRPR_WRP_Bit0                      (0x00000001U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit1                      (0x00000002U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit2                      (0x00000004U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit3                      (0x00000008U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit4                      (0x00000010U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit5                      (0x00000020U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit6                      (0x00000040U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit7                      (0x00000080U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit8                      (0x00000100U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit9                      (0x00000200U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit10                     (0x00000400U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit11                     (0x00000800U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit12                     (0x00001000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit13                     (0x00002000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit14                     (0x00004000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit15                     (0x00008000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit16                     (0x00010000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit17                     (0x00020000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit18                     (0x00040000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit19                     (0x00080000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit20                     (0x00100000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit21                     (0x00200000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit22                     (0x00400000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit23                     (0x00800000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit24                     (0x01000000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit25                     (0x02000000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit26                     (0x04000000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit27                     (0x08000000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit28                     (0x10000000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit29                     (0x20000000U << FLASH_WRPR_WRP_Pos) 
#define  FLASH_WRPR_WRP_Bit30                     (0x40000000U << FLASH_WRPR_WRP_Pos) 

/**
  * @brief FLASH_SEC_KEY0 Register Bit Definition
  */
#define  FLASH_SEC_KEY0_SECKEYL_Pos               (0)
#define  FLASH_SEC_KEY0_SECKEYL_Msk               (0xFFFFFFFFU << FLASH_SEC_KEY0_SECKEYL_Pos)       /*!<*/
#define  FLASH_SEC_KEY0_SECKEYL                   FLASH_SEC_KEY0_SECKEYL_Msk
#define  FLASH_SEC_KEY0_SECKEYL_Bit0              (0x00000001U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit1              (0x00000002U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit2              (0x00000004U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit3              (0x00000008U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit4              (0x00000010U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit5              (0x00000020U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit6              (0x00000040U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit7              (0x00000080U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit8              (0x00000100U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit9              (0x00000200U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit10             (0x00000400U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit11             (0x00000800U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit12             (0x00001000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit13             (0x00002000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit14             (0x00004000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit15             (0x00008000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit16             (0x00010000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit17             (0x00020000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit18             (0x00040000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit19             (0x00080000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit20             (0x00100000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit21             (0x00200000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit22             (0x00400000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit23             (0x00800000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit24             (0x01000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit25             (0x02000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit26             (0x04000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit27             (0x08000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit28             (0x10000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit29             (0x20000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit30             (0x40000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 
#define  FLASH_SEC_KEY0_SECKEYL_Bit31             (0x80000000U << FLASH_SEC_KEY0_SECKEYL_Pos) 

/**
  * @brief FLASH_SEC_KEY1 Register Bit Definition
  */
#define  FLASH_SEC_KEY1_SECKEYH_Pos               (0)
#define  FLASH_SEC_KEY1_SECKEYH_Msk               (0xFFFFFFFFU << FLASH_SEC_KEY1_SECKEYH_Pos)       /*!<*/
#define  FLASH_SEC_KEY1_SECKEYH                   FLASH_SEC_KEY1_SECKEYH_Msk
#define  FLASH_SEC_KEY1_SECKEYH_Bit0              (0x00000001U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit1              (0x00000002U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit2              (0x00000004U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit3              (0x00000008U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit4              (0x00000010U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit5              (0x00000020U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit6              (0x00000040U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit7              (0x00000080U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit8              (0x00000100U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit9              (0x00000200U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit10             (0x00000400U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit11             (0x00000800U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit12             (0x00001000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit13             (0x00002000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit14             (0x00004000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit15             (0x00008000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit16             (0x00010000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit17             (0x00020000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit18             (0x00040000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit19             (0x00080000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit20             (0x00100000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit21             (0x00200000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit22             (0x00400000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit23             (0x00800000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit24             (0x01000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit25             (0x02000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit26             (0x04000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit27             (0x08000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit28             (0x10000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit29             (0x20000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit30             (0x40000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 
#define  FLASH_SEC_KEY1_SECKEYH_Bit31             (0x80000000U << FLASH_SEC_KEY1_SECKEYH_Pos) 

/**
  * @brief FLASH_SEC_CR Register Bit Definition
  */
#define  FLASH_SEC_CR_SECER_Pos                   (0)
#define  FLASH_SEC_CR_SECER_Msk                   (0x1U << FLASH_SEC_CR_SECER_Pos)                  /*!<*/
#define  FLASH_SEC_CR_SECER                       FLASH_SEC_CR_SECER_Msk
#define  FLASH_SEC_CR_KEY_Pos                     (24)
#define  FLASH_SEC_CR_KEY_Msk                     (0xFFU << FLASH_SEC_CR_KEY_Pos)                   /*!<*/
#define  FLASH_SEC_CR_KEY                         FLASH_SEC_CR_KEY_Msk
#define  FLASH_SEC_CR_KEY_Bit0                    (0x01U << FLASH_SEC_CR_KEY_Pos) 
#define  FLASH_SEC_CR_KEY_Bit1                    (0x02U << FLASH_SEC_CR_KEY_Pos) 
#define  FLASH_SEC_CR_KEY_Bit2                    (0x04U << FLASH_SEC_CR_KEY_Pos) 
#define  FLASH_SEC_CR_KEY_Bit3                    (0x08U << FLASH_SEC_CR_KEY_Pos) 
#define  FLASH_SEC_CR_KEY_Bit4                    (0x10U << FLASH_SEC_CR_KEY_Pos) 
#define  FLASH_SEC_CR_KEY_Bit5                    (0x20U << FLASH_SEC_CR_KEY_Pos) 
#define  FLASH_SEC_CR_KEY_Bit6                    (0x40U << FLASH_SEC_CR_KEY_Pos) 
#define  FLASH_SEC_CR_KEY_Bit7                    (0x80U << FLASH_SEC_CR_KEY_Pos) 


#endif

